"""
    124 나라의 숫자 (수학, 규칙성, 진법)

    사고과정

    11은 42
    12은 44
    13 111
    14 112
    15 114

   1, 2, 3 -> 1자리 표현  3개
   4, 5, 6, 7, 8, 9, 10, 11, 12 -> 2자리 표현 9개
   13, 14, ....              39 -> 3자리 표현 27개
   40 ...                   120 -> 4자리 표현 81개
   121 ...

   40 -> 1111
   67 -> 2111
   94 -> 4111

   1. 몇 자리로 표현되는 지 확인 한다.
   작거나 같은
   50  => 1+3+9+27 = 40 4자리로 표현

   n = 4

   40 1111
   41 1112
   42 1114
   43 1121
   44 1122
   45 1124
   46 1141
   47 1142
   48 1144
   49 1211
   50 1212

   50 - 40
   temp = 27*0 +9*1+ 3*0+ 1*1

   ansewr = 1212

  2. 11..1 로 시작하는 자릿수를 통해 범위 확인 이후 얼마나 떨어져 있는지 구한다.

    if 40 + 3^(n-1)*0 <= 50  < 40 + 3^(n-1)*1
        1
    elif 40 + 3^(n-1)*1 <= 50  < 40 + 3^(n-1)*2
        2
    elif 40 + 3^(n-1)*2 <= 50  < 40 + 3^(n-1)*3
        4

"""

# import sys
#
# input = sys.stdin.readline
#
#
# def solution(n):
#     answer = ''
#
#     cnt = 0
#     temp = 0
#     while temp + (3 ** cnt) <= n:
#         temp += 3 ** cnt
#         cnt += 1
#
#     n -= temp
#     nums = []
#     for i in range(cnt, 0, -1):
#         if (3 ** (i - 1)) * 0 <= n < (3 ** (i - 1)) * 1:
#             nums.append('1')
#         elif (3 ** (i - 1)) * 1 <= n < (3 ** (i - 1)) * 2:
#             n -= (3 ** (i - 1)) * 1
#             nums.append('2')
#         elif (3 ** (i - 1)) * 2 <= n < (3 ** (i - 1)) * 3:
#             n -= (3 ** (i - 1)) * 2
#             nums.append('4')
#
#     for num in nums:
#         answer += num
#
#     return answer
#
#
# if __name__ == '__main__':
#     solution(4)
